<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(
    /*------页面标题------*/
    'page'             => array(
        'edit'              => '编辑',
        'add'               => '创建',
        'show'              => '查看',
    ),

    /*------链接文字------*/
    'href'             => array(
        'all'             => '全部',
        'add'             => '创建',
        'edit'            => '编辑',
        'help'            => '帮助',

        'adminAdd'        => '创建管理员', //授权
        'adminAuth'       => '授权为管理员', //授权
        'show'            => '查看',
    ),

    'type' => array(
        'normal'    => '普通管理员',
        'super'     => '超级管理员',
    ),

    'status' => array(
        'enable'  => '启用', //生效
        'disable' => '禁用', //禁用
    ),

    /*------说明文字------*/
    'label'            => array(
        'id'                => 'ID',
        'all'               => '全部',
        'key'               => '关键词',
        'type'              => '类型',
        'unknow'            => '未知',
        'status'            => '状态',
        'allow'             => '权限',
        'admin'             => '管理员',
        'nick'              => '昵称',
        'note'              => '备注',
        'onlyModi'          => '需要修改时输入', //需要修改时输入

        'username'          => '用户名',
        'password'          => '密码',
        'profileAllow'      => '个人权限',
        'forbidModi'        => '禁止修改',
    ),

    /*------选择项------*/
    'option'           => array(
        'allStatus'         => '所有状态',
        'allType'           => '所有类型',
        'batch'             => '批量操作',
        'del'               => '永久删除',
    ),

    /*------按钮------*/
    'btn' => array(
        'submit'    => '提交',
        'save'      => '保存',
    ),

    /*------确认框------*/
    'confirm'          => array(
        'del'             => '确认永久删除吗？此操作不可恢复！',
    ),
);
