<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------通用-------------------------*/
return array(
    'page' => array(
        'profile'           => '管理员个人信息',
    ),
    /*------说明文字------*/
    'label'            => array(
        'id'                => 'ID',
        'status'            => '状态',
        'type'              => '类型',
        'username'          => '用户名',
        'password'          => '密码',
        'passOld'           => '原密码',
        'passNew'           => '新密码',
        'passConfirm'       => '确认密码',
        'nick'              => '昵称',
        'allow'             => '权限',
        'mailOld'           => '原邮箱',
        'mailNew'           => '新邮箱',
        'secQues'           => '密保问题',
        'secAnsw'           => '密保答案',
        'forbidModi'        => '禁止修改',
    ),

    'quesOften' => array(
        '您祖母叫什么名字',
        '您祖父叫什么名字',
        '您的生日是什么时候',
        '您母亲的名字',
        '您父亲的名字',
        '您宠物的名字叫什么',
        '您的车号是什么',
        '您的家乡是哪里',
        '您小学叫什么名字',
        '您最喜欢的颜色',
        '您女儿/儿子的小名叫什么',
        '谁是您儿时最好的伙伴',
        '您最尊敬的老师的名字',
    ),

    'status' => array(
        'enable'  => '启用', //生效
        'disable' => '禁用', //禁用
    ),

    'type' => array(
        'normal'    => '普通管理员',
        'super'     => '超级管理员',
    ),

    'option'           => array(
        'pleaseQuesOften'   => '请选择常用密保问题',
    ),

    /*------按钮------*/
    'btn' => array(
        'save'      => '保存',
    ),
);
