<?php
return "<h3>崇尚简单</h3>
	<p>baigo SSO 以简单为设计、开发的宗旨，安装部署简单、使用简单。baigo SSO 没有复杂的菜单，没有深奥的概念，没有晦涩难懂的名词，一切崇尚简单。</p>

	<h3>开源、免费</h3>
	<p>baigo SSO 是一款开源、免费的网站内容管理系统。baigo Studio 承诺该系统永久免费使用，并永久享受升级服务。</p>

	<h3>一个账号、全网通行</h3>
	<p>利用 baigo SSO，可以便捷的实现多站点的用户整合，用户使用一个账号，便可以全网通行，无需在多个应用之间重复注册、登录。</p>

	<h3>基于最流行的语言开发</h3>
	<p>baigo SSO 是采用 PHP + MySQL 开发的网站内容管理系统。PHP 与 MySQL 可以免费使用，流行广泛，可以运行在 Linux、Windows 或者 Mac 平台，具有良好的通用性。</p>

	<h3>丰富的 API 接口</h3>
	<p>baigo SSO 采用 HTTP 方式调用 API 接口，可以完全消除兼容问题。部署灵活，可以是单台服务器，也可以是局域网、广域网。</p>";
