<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if (!defined('IN_BAIGO')) {
    exit('Access Denied');
}

/*-------------------------权限-------------------------*/
return array(
    /*------用户------*/
    'user' => array(
        'title' => 'Users',
        'allow' => array(
            'reg'       => 'Register',
            'edit'      => 'Edit',
            'del'       => 'Delete',
            'global'    => 'Operate all Users',
        ),
    ),
);
