<?php
/*-----------------------------------------------------------------
！！！！警告！！！！
以下为系统文件，请勿修改
-----------------------------------------------------------------*/

//不能非法包含或直接执行
if(!defined("IN_BAIGO")) {
	exit("Access Denied");
}

/*-------------------------api 语言-------------------------*/
return array(
	"site" => array(
		"name" => "baigo SSO",
	),

	"regMail" => array(
		"subject"     => "注册确认信",
		"content_1"   => "感谢您的注册，请点击以下链接确认注册。",
		"content_2"   => "如无法点击，请打开以下地址，并输入验证码，确认注册。",
		"userName"    => "用户名：",
		"userRand"    => "验证码：",
	),
);
